testing/results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/r1.6/4e1pd/docker_bench_4e1pd_r1.6.log
/opt/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] `KimiVLProcessor` defines `image_processor_class = 'AutoImageProcessor'`, which is deprecated. Register the correct mapping in `AutoImageProcessor` instead.
/opt/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1920x1080) with 512 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=0, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/mnt/weka/data/llm-d-models-pv/hub/models--moonshotai--Kimi-VL-A3B-Instruct/snapshots/main', served_model_name='moonshotai/Kimi-VL-A3B-Instruct', tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=16, random_range_ratio=0.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.6, use_trace_timestamps=False, max_concurrency=8, output_file='/results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/r1.6/4e1pd/bench_4e1pd_r1.6.json', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=0, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/mnt/weka/data/llm-d-models-pv/hub/models--moonshotai--Kimi-VL-A3B-Instruct/snapshots/main', served_model_name='moonshotai/Kimi-VL-A3B-Instruct', tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=16, random_range_ratio=0.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.6, use_trace_timestamps=False, max_concurrency=8, output_file='/results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/r1.6/4e1pd/bench_4e1pd_r1.6.json', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 542224
#Output tokens: 1051
#Total images: 512
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=62.8, total=8036
  Text prompt tokens (with chat template): avg=80.1, total=10256
  Text prompt overhead: avg=17.3, total=2220
  Vision tokens: avg=4156.0, total=531968

Created 128 random jpeg images with average 8359299 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.6       
Max request concurrency:                 8         
Successful requests:                     128       
Benchmark duration (s):                  130.28    
Total input tokens:                      542224    
Total input text tokens:                 10256     
Total input vision tokens:               531968    
Total generated tokens:                  1051      
Total generated tokens (retokenized):    1047      
Request throughput (req/s):              0.98      
Input token throughput (tok/s):          4162.13   
Output token throughput (tok/s):         8.07      
Peak output token throughput (tok/s):    62.00     
Peak concurrent requests:                14        
Total token throughput (tok/s):          4170.20   
Concurrency:                             7.65      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7785.13   
Median E2E Latency (ms):                 7662.52   
P90 E2E Latency (ms):                    10412.10  
P99 E2E Latency (ms):                    13480.74  
---------------Time to First Token----------------
Mean TTFT (ms):                          6472.79   
Median TTFT (ms):                        6103.43   
P99 TTFT (ms):                           10490.14  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          215.20    
Median TPOT (ms):                        67.74     
P99 TPOT (ms):                           1415.17   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           182.78    
Median ITL (ms):                         51.52     
P95 ITL (ms):                            1027.46   
P99 ITL (ms):                            3143.64   
Max ITL (ms):                            5222.64   
==================================================
wrote /results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/r1.6/4e1pd